// < Качмар Владислав>
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 12
#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    double x; // Вхідний аргумент
    double y; // Результат обчислення
    double A; // Стала частина виразу
    double B; // Змінна частина виразу

    cout << "x = ";
    cin >> x;

    // Обчислення функціонально сталої частини
    A = (2.0 + x) / (x * x) + 1.0;

    // Спосіб 1: використання лише команд розгалуження в скороченій формі
    
    if (x < 0)
        B = pow(x, 4) - 2 * x * x;

    if (0 <= x && x <= 2)
        B = pow(abs(x) + exp(x), 3);

    if (x > 2)
        B = cos(x * x - 2);

    y = A + B;
    cout << "1) y = " << y << endl;

   
    // Спосіб 2: використання лише команд розгалуження в повній формі
  
    if (x < 0)
        B = pow(x, 4) - 2 * x * x;
    else if (x > 2)
        B = cos(x * x - 2);
    else
        B = pow(abs(x) + exp(x), 3);

    y = A + B;
    cout << "2) y = " << y << endl;

    cin.get();
    return 0;
}